/************************************************
 * txchar.c
 * Yu Yoshida
 * =============================================
 * 1byte文字をビットシフトで送信するソースファイル
 * =============================================
 * ・ver1.00 初版 2015/01/15 Yu Yoshida
 * =============================================
 * PIC16F88
 * XC8 (v1.35/Win)
 * =============================================
 * Created by fabsat Project (Tokai University)
 ************************************************/

 #include "txchar.h"
 #include "pic_clock.h"

 /*=====================================================
 * @breif
 *     picから文字データを出力する関数
 * @param
 *     *moji: 文字データを格納した配列の先頭アドレス
 * @return
 *     なし
 * @note
 *     delayは受信とのタイミングを揃えるため。
 *===================================================*/
/*文字データを1bitずつ送信していく関数*/
void txchar(char *moji)
{
    for (int i=0; i<9; i++){
            RA2 = moji[i];
            __delay_ms(100);
        }
}
